{"adult":false,"also_known_as":[],"biography":"Genevieve O'Reilly (born January 6, 1977) is an Irish actress who has worked in both the United Kingdom and Australia. O'Reilly was cast as the understudy in director Gale Edwards' production of The White Devil a week after graduating from drama school. She went on to appear in Edwards' Sydney Theatre Company production of The Way of the World.Other theatre credits include The Weir by Conor McPherson, at the Gate Theatre, Dublin, and Richard II at the Old Vic.Recent parts at the Royal National Theatre have been in new play, Mike Bartlett's 13 and as Helena, wife to Andrew Scott's emperor Julian in the 2011 production of Ibsen's epic Emperor and Galilean. O'Reilly is due to perform in George Bernard Shaw's The Doctor's Dilemma from July 2012. O'Reilly has appeared in several productions filmed in Australia, including both The Matrix sequels. She also played the young Mon Mothma in Star Wars Episode III: Revenge of the Sith, and starred as Leanne Curtis in the medical drama All Saints. Since moving to the UK, O'Reilly has starred in the political mini-series The State Within, played Princess Diana in the 2007 television docudrama Diana: Last Days of a Princess, and taken the lead role in The Time of Your Life. She played CIA liaison officer Sarah Caulfield in the eighth series of BBC drama Spooks. O'Reilly also played the character of Michelle Beadley in the remake of The Day of the Triffids that aired on BBC One in December 2009. In 2011 she appeared in the BBC/Showtime comedy Episodes playing Jamie Lapidus, the blind wife of a TV executive, Merc Lapidus. She reprised the role in the second and third series, broadcast in 2012 and 2014. O'Reilly's film credits include Right Here Right Now (2004), The Young Victoria (2009) and the 2004 science fiction filmAvatar, playing the lead role of Dash MacKenzie. In June 2013, O'Reilly appeared in the pilot episode of the international crime drama \"Crossing Lines\" cast as Detective and Interrogation Specialist Sienna Pride, attached to the ICC team from Britain's Scotland Yard. In the final minutes of this pilot episode, her character was stabbed and killed with a knife used by an American State Department employee, Gerald Wilhoit (Eddie Jemison) who enjoyed Diplomatic Immunity, while the ICC team was chasing him (and searching for their abducted police colleague) in the Tiergarten Park in Berlin, Germany.","birthday":"1977-01-06","deathday":"","homepage":"","id":139654,"imdb_id":"nm0642444","name":"Genevieve O'Reilly","place_of_birth":"Dublin - Ireland","popularity":3.4E-4,"profile_path":"/8NrrFxrGng88GU7lxwOyK3PZv05.jpg"}