{"adult":false,"also_known_as":[],"biography":"Michael Clarke Duncan was born December 10, 1957 in Chicago, Illinois He is best known for his breakout role as John Coffey in The Green Mile.  In 1998, Duncan was cast as Bear in the film Armageddon, where he struck up a friendship with castmate Bruce Willis. It was Bruce Willis' influence that helped him to get his breakout role as John Coffey in the Frank Darabont-directed The Green Mile, a role which netted him an Academy Award nomination for Best Actor in a Supporting Role and a Golden Globe nomination for Best Performance by an Actor in a Supporting Role in a Motion Picture.  Duncan then was cast in a string of films that helped to establish him as a star: The Whole Nine Yards, Planet of the Apes, The Scorpion King (where he starred alongside his friend, The Rock), The Island and Daredevil as Wilson Fisk, aka The Kingpin.    Duncan has also provided his voice for a number of roles including Brother Bear, The Land Before Time XI: Invasion of the Tinysauruses, Quiznos commercials, and the video games Demon Stone, SOCOM II: U.S. Navy SEALs, The Suffering: Ties That Bind, Saints Row, and Soldier of Fortune, with his most recent role being God of War II, where he provides the voice of Atlas, the Titan condemned by Zeus to stand at the western edge of the earth and hold up the sky on his shoulders. He later reprised his role as the Kingpin in Spider-Man: The New Animated Series.  In 2005, he starred in the film Sin City (again alongside Bruce Willis) as Manute, a powerful mobster. Duncan appeared in a minor role in the 2006 movie Talladega Nights: The Ballad of Ricky Bobby as Lucius Washington, and he voiced the role of the villain Massive in the Loonatics Unleashed.  In 2006, he voiced the role of Numbuh 26 in the animated movie Codename: Kids Next Door: Operation ZERO. He played Balrog in Street Fighter: The Legend of Chun-Li and voiced the prison commander in Kung Fu Panda.  In 2011, Duncan plays ‘The Giant Troll’ in the fantasy comedy film, Your Highness and will reprise his role in the SinCity sequels.  On September 3 2012 Michael Clarke Duncan passed away from complications after a massive heart attack on July 13th 2012.","birthday":"1957-12-10","deathday":"2012-09-03","homepage":"","id":61981,"imdb_id":"nm0003817","name":"Michael Clarke Duncan","place_of_birth":"Chicago, Illinois, U.S.","popularity":6.308676,"profile_path":"/CEbgxAwcbIN8DxyD16BviQbgwr.jpg"}