{"adult":false,"also_known_as":["Jeffrey Bridges","Jeffrey Leon Bridges"],"biography":"American actor Jeff Bridges has starred in over 50 films during his lengthy career. He comes from a family of performers and was introduced to show business by his father Lloyd. Jeff is most famous for his work in the films Big Lebowski (1998), Seabiscuit (2003), Crazy Heart (2009), and most recently True Grit (2010). His accolades include a long list of Academy Award nominations, and one win for Best Actor in 2010.\n\nBridges was born in 1949 and grew up in Los Angeles, California. After high school Jeff traveled to New York to study acting at the famous Herbert Berghof Studio. In the late 1960's Jeff served in the US Coast Guard, and stayed on reserve through the early 1970's to avoid Vietnam. As a child Jeff got a start in acting through his father Lloyd, and even starred in two of his television shows. Jeff achieved major success early in his career when he was nominated for an Academy Award in his first major film, the 1971 drama Last Picture Show. Three years later he starred opposite of Clint Eastwood in Thunderbolt and Lightfoot.\n\nBy 1976 Bridges was casted in the first remake of King Kong, which turned out to be a huge commercial success raking in more than 90 million dollars. Over the next three decades Bridges went on to star in over 50 films and win countless awards for his work. More recently Jeff starred in the 2009 film Crazy Heart, which earned him his first Academy Award for Best Actor.\n\nIn 1977 Jeff married Susan Geston, the two met while filming Ranch Deluxe. Together they have three daughters.\n\nAlong with other entertainment industry leaders, in 1984 Bridges founded the End Hunger Network, a humanitarian effort which aims to eliminate childhood hunger in the US by 2015.\n\nAlong with his charitable work, Jeff is also known for his music and photography.","birthday":"1949-12-04","deathday":"","homepage":"http://www.jeffbridges.com/","id":1229,"imdb_id":"nm0000313","name":"Jeff Bridges","place_of_birth":"Los Angeles, California, USA","popularity":7.113641,"profile_path":"/orLtq2zGw7C8cfByDobPz5BCHnD.jpg"}