{"adult":false,"also_known_as":[],"biography":"Billy Dee Williams was born in He began his acting career when he first appeared on Broadway in 1945 in The Firebrand of Florence. He returned to Broadway as an adult in 1960 in the play version of The Cool Word. He appeared in A Taste of Honey in 1961. A 1976 Broadway production, I Have a Dream, starred Williams as Martin Luther King, Jr. His most recent Broadway appearance was in August Wilson's Fences in 1988. He made his film debut in 1959 in The Last Angry Man, starring Paul Muni, in which he portrayed a juvenile delinquent. His first big break was in the biographical TV movie, Brian's Song (1971), in which he played Chicago Bears star football player Gale Sayers, who stood by his friend Brian Piccolo (played by James Caan), during his struggle with terminal cancer. Both Williams and Caan were nominated for Emmy Awards for their performances. In 1972, he played Billie Holliday's husband Louis McKay in Motown Productions' Holiday biopic Lady Sings the Blues. Diana Ross starred in Lady Sings the Blues opposite Williams; Motown paired the two of them again three years later in Mahogany. His most widely recognized role is that of Lando Calrissian, which he played in Star Wars Episode V: The Empire Strikes Back and in Star Wars Episode VI: Return of the Jedi. He reprised this role when he lent his voice for the character in the 2002 video game Star Wars Jedi Knight II: Jedi Outcast, as well as the audio dramatization of Dark Empire, the National Public Radio adaptation of Star Wars Episode V: The Empire Strikes Back, and two productions for the Star Wars Battlefront series: Star Wars Battlefront II and Star Wars Battlefront: Elite Squadron. Williams had originally auditioned for the role of Han Solo during the casting of Star Wars Episode IV: A New Hope. Another notable role was in 1989's Batman as district attorney Harvey Dent. In 1992, he portrayed Berry Gordy in The Jacksons: An American Dream Williams has had several television appearances as a guest star or recurring character, some of which include; Gideon's Crossing, General Hospital, The Jeffersons, 227, The Cosby Show, A Different World, In Living Color, The Hughleys, Scrubs Season 5, That '70s Show, Lost, The Boondocks and White Collar. He is also well-known for his appearance in advertisements for Colt 45 (a brand of malt liquor) in the 1980s and early 1990s, for which he received much criticism. Williams has been married three times.","birthday":"1937-04-06","deathday":"","homepage":"","id":3799,"imdb_id":"nm0001850","name":"Billy Dee Williams","place_of_birth":"New York City - New York - USA","popularity":2.988309,"profile_path":"/eNeMDBPjWcJBhpT25hhj9A3LiQO.jpg"}