{"adult":false,"also_known_as":[],"biography":"Sean Frye was born in Hollywood to an American actor and an Irish native. Pushed into child labor (commercial television) at age 6, Frye was already studying with Mr. Lee Strasberg at The Actors Studio in Hollywood by age 9. Frye was eventually spotted in a Crest toothpaste commercial by director Ted Kotcheff and landed the role (sight unseen) of son Billy in the 1977 film \"Fun with Dick and Jane.\" Father Virgil Frye (1930-2012) met caterer Sondra Peluce on the set of one of Frye's commercial television film shoots for M&M Candies, and his sister (actress, Soleil Moon Frye) was born soon thereafter. Frye \"introduced\" Soleil to his talent agency Herb Tannen & Associates and sister Soleil went on to much greater success. Sean Frye co-starred in long running stage productions of \"The Petrified Man\" opposite Marian Mercer, La MaMa Theater's \"Skyjack '76, Entebbe\" (Drama Critics Circle Award winner), and the madcap comedy \"Crazy Marriage.\" Frye co-starred as Elizabeth Montgomery's son in two consecutive TV productions (\"The Awakening Land\" and \"Act of Violence\") and also portrayed Melissa Gilbert's very first love interest on \"Little House on the Prairie.\" Best remembered as co-star Steve in the blockbuster classic \"E.T. The Extra-Terrestrial\" (1982), Frye was a world traveler by age 14. Briefly married to Rita Trinidad in 1987, Frye retired from the film industry in 1988, entering into social work following the death of two very close friends. In 1993 Frye met his spouse (retired army veteran Michael Alexander) when Alexander issued Frye a parking ticket in West Hollywood. The couple adopted their infant son (and center of their universe), Logan Frye Alexander, in 2003 and proceeded to live happily ever after.  IMDb Mini Biography By: reservoir@att.net","birthday":"1966-09-16","deathday":"","homepage":"","id":9981,"imdb_id":"nm0296892","name":"Sean Frye","place_of_birth":" Hollywood, California, USA","popularity":3.0E-6,"profile_path":"/ce22ZO5D7a8ATdiblkk0yF03Uu9.jpg"}