{"adult":false,"also_known_as":[],"biography":"​From Wikipedia, the free encyclopedia.  \n\nMartin Klebba (born June 23, 1969) is an American actor and stunt performer. Klebba has a form of dwarfism called acromicric dysplasia; he is 4'1\" tall.\nKlebba was born and grew up in Troy, Michigan, graduating from Athens High School.\nKlebba has acted in various productions, most notably Pirates of the Caribbean as \"Marty\", one of Captain Jack Sparrow's Black Pearl crew, in all three of the first trilogy. He made many appearances as \"Randall Winston\" in the television series Scrubs. As of 2010, he is working on the 2011 NBC show The Cape as a series regular named \"Rollo.\" Also guest starred as \"Hibachi\" in Pair of Kings, a Disney TV series. He starred in the CSI: Crime Scene Investigation episode \"The Chick Chop Flick Shop\" (2007) as \"Dickie Jones\", and in the CSI: NY episode \"Uncertainty Rules\" (2010) as \"Calvin Moore.\" He played \"Todd Moore\" in the Bones episode \"Dwarf in the Dirt\" (2010). He also made an appearance as a demon in the Charmed episode \"Witch Wars\" (2004), and starred as \"Hank Dingo\" in the Comedy Central made-for-TV movie Knee High P.I. He appeared in iCarly and Drake and Josh as \"Nug Nug.\" Additionally, Klebba plays the role of \"Count Le Petite\" in the upcoming (2010) release of All's Faire in Love, a romantic comedy set at a Renaissance fair, which was shot on location at the Michigan Renaissance Festival. He also starred as \"Friday,\" one of the seven dwarfs in the 2001 made-for-TV film Snow White, and appeared as the ring announcer in the movie Cradle 2 the Grave alongside Jet Li, Tito Ortiz, Chuck Liddell, Randy Couture and DMX. He has also been in low budget horror/comedy films Feast 2 & 3 as \"Thunder.\" He has numerous stunt credits as well including Hancock, Zombieland, Bedtime Stories, Evan Almighty, Meet the Spartans, Epic Movie, and Van Helsing.\nKlebba has also been featured on the TLC reality show, Little People, Big World, with his good friend Amy Roloff.\n\nDescription above from the Wikipedia article Martin Klebba, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1969-06-23","deathday":"","homepage":"","id":4030,"imdb_id":"nm0458514","name":"Martin Klebba","place_of_birth":"Troy, Michigan, U.S.","popularity":0.691766,"profile_path":"/amlhUrXQ7t1NEPajdj2dQdbC0rt.jpg"}