{"adult":false,"also_known_as":[],"biography":"From Wikipedia\n\nJane Wyatt (August 12, 1910 – October 20, 2006) was an American actress best known for her role as the housewife and mother on the NBC and CBS television comedy series, Father Knows Best, and as Amanda Grayson, the human mother of Spock on the science fiction television series Star Trek. Wyatt was a three-time Emmy Award-winner.\n\nJane Waddington Wyatt was born on August 12, 1910 in Mahwah, New Jersey, but raised in Manhattan. Her father, Christopher Billopp Wyatt, Jr., was a Wall Street investment banker, and her mother, the former Euphemia Van Rensselaer Waddington, was a drama critic for the Catholic World. Both of her parents were Roman Catholic converts.\n\nShe made her film debut in 1934 in One More River. In arguably her most famous role, she co-starred as Ronald Colman's character's love interest in Frank Capra's Columbia Pictures film Lost Horizon (1937).\n\nOther film appearances included Gentleman's Agreement with Gregory Peck, None but the Lonely Heart with Cary Grant, Boomerang with Dana Andrews, and Our Very Own. Her film career suffered because of her outspoken opposition to Senator Joseph McCarthy, the chief figure in the anti-Communist investigations of that era, and was temporarily derailed for having assisted in hosting a performance by the Bolshoi Ballet during the Second World War, even though it was at the request of President Franklin D. Roosevelt. Wyatt returned to her roots on the New York stage for a time and appeared in such plays as Lillian Hellman's The Autumn Garden, opposite Fredric March.\n\nFor many people, Wyatt is best remembered as Margaret Anderson on Father Knows Best, which aired from 1954 to 1960. She played opposite Robert Young as the devoted wife and mother of the Anderson family in the Midwestern town of Springfield. This role won Wyatt three Emmy Awards for best actress in a comedy series. After Father Knows Best, Wyatt guest starred in several other series.\n\nOn June 13, 1962, she was cast in the lead in \"The Heather Mahoney Story\" on NBC's Wagon Train. In 1963, she portrayed Kitty McMullen in \"Don't Forget to Say Goodbye\" on the ABC drama, Going My Way, with Gene Kelly and Leo G. Carroll, a series about the Catholic priesthood in New York City. In 1965, Wyatt was cast as Anne White in \"The Monkey's Paw – A Retelling\" on CBS's The Alfred Hitchcock Hour.\n\nWyatt was married to investment broker Edgar Bethune Ward from November 9, 1935, until his death on November 8, 2000, just one day short of the couple's 65th wedding anniversary. The couple reportedly met in the late 1920s when both were weekend houseguests of Franklin D. Roosevelt at Hyde Park, New York. Ward later converted to the Catholic faith of his wife. Wyatt suffered a mild stroke in the 1990s, but recovered well. She remained in relatively good health for the rest of her life\n\nJane Wyatt died on October 20, 2006 of natural causes at her home in Bel-Air, California, aged 96. She was interred at San Fernando Mission Cemetery, next to her husband.","birthday":"1910-08-12","deathday":"2006-10-20","homepage":"","id":2021,"imdb_id":"nm0943553","name":"Jane Wyatt","place_of_birth":"Campgaw - New Jersey - USA","popularity":2.771245,"profile_path":"/jLwnhKOMwn67LnbxJFSPUFexnkk.jpg"}