{"adult":false,"also_known_as":["Yun-Fat Chow"],"biography":"Chow Yun Fat is a charismatic, athletically built and energetic Asian-born film star who first came to the attention of western audiences via his roles in the high-octane/blazing guns action films of maverick HK director John Woo.\n\nBorn in 1955 on the quiet island of Lamma, part of the then British colony of Hong Kong near its famous Victoria Harbour, Chow's family moved to urban Hong Kong in 1965 and in early 1973, Chow attended a casting call for TVB, a division of Shaw Bros. productions. With his good looks and easy-going style, Chow was originally a heartthrob actor in non-demanding TV and film roles. However, his popularity increased with his appearance as white-suited crime boss Hui Man-Keung in the highly popular HK film Shang Hai tan xu ji (1983).\n\nIn 1985, Chow started receiving acclaim for his work and scored the Golden Horse (Best Actor) Award in Taiwan and another Best Actor Award from the Asian Pacific Film Festival for his performance in Dang doi lai ming (1984). With these accolades, Chow came to the attention of Woo, who cast Chow in the fast-paced gangster film Ying hung boon sik (1986) (aka \"A Better Tomorrow\"). The rest, as they say, is history. The film was an enormous commercial success, and Chow's influence on young Asian males was not dissimilar to the adulation given to previous Asian film sensations such as Bruce Lee or Jackie Chan. Nearly every young guy in Hong Kong ran out and bought himself a \"Mark Coat,\" as they became known--a long, heavy woolen coat worn by Chow in the movie (although it is is actually very unsuited to Hong Kong's hot and humid climate).\n\nFurther hard-edged roles in more John Woo crime films escalated Chow's popularity even higher, and fans all over the world flocked to see Ying hung boon sik II (1987) (aka \"A Better Tomorrow 2\"), Dip huet seung hung (1989) (aka \"The Killer\"), and Lat sau san taam (1992) (aka \"Hard Boiled\"). With the phenomenal global interest in the HK action genre, Chow was enticed to the United States and appeared in The Replacement Killers (1998) with Mira Sorvino, The Corruptor (1999) with Mark Wahlberg, and, for a change of pace, in the often-filmed romantic tale of Anna and the King (1999).\n\nChow then returned to the Asian cinema circuit and starred in the critically lauded kung fu epic Wo hu cang long (2000) (aka \"Crouching Tiger, Hidden Dragon\"). His wide appeal can be seen in his \"boy next door\" type of personality and his ability to play such a broad spectrum of roles from a comedic buffoon to a lovestruck Romeo to a trigger-happy professional killer. A highly entertaining and gifted actor with dynamic on-screen presence, Chow continues to remain in strong demand in many film markets.","birthday":"1955-05-18","deathday":"","homepage":"","id":1619,"imdb_id":"nm0000334","name":"Chow Yun-Fat","place_of_birth":"Lamma Island, Hong Kong","popularity":3.374207,"profile_path":"/c9QcWUSfHjNrH5dQQobqCKfHzUj.jpg"}