{"adult":false,"also_known_as":["Zoë Saldana","Zoe Saldaña","Zoë Saldaña"],"biography":"Zoë Yadira Saldana was born June 19, 1978 in Passaic NJ to a Peurto Rican mother and Dominican father. Her family relocated to the Dominican Republic when she was ten years old. There she practiced ballet at one of the most pretigious dance schools in the country. Saldana returned to New York at age 17, where she began involving herself in theatre groups such as Faces and the New York Youth Theatre. Her ballet training helped land her first on screen part as Eva in the dance film, Center Stage (2000). The actress’ career continued to flourish with roles in Pirates of The Caribbean: The Curse of the Black Pearl (2003) with Johnny Depp, The Terminal (2004) starring Tom Hanks, and Guess Who (2005) opposite Ashton Kutcher. Saldana continues to act and model with editorial features in Elle, Vanity Fair, V, GQ Italia, and Nylon.\n\nCareer Highlights\n\nSaldana’s career climbed to new heights in 2009 when she played Uhura in Star Trek. She officially joined the A-list with her groundbreaking role as Neytiri, the Na’vi princess, in James Cameron’s Avatar (2009). Saldana brought her fictional character to life through motion capture technology. This visual effects fueled film has revolutionized the movie industry.\n\nPersonal Life\n\nSaldana continues to frequent the Dominican Republic and has two sisters, Cisely and Mariel, who appeared wtih her in a 2007 Gap advertisement.\n\nCurrently\n\nIn the past year Saldana has become a fashion icon with the help of her stylist Petra Flannery. She’s frequently spotted front row at fashion weeks around the globe and remains impressive on the red carpet. Saldana continues to seek roles that challenge her as a woman and as an artist.\n\nCinestar Pictures\n\nCinestar Pictures LLC was formed by Zoë Saldana and other partners in May of 2006. The production company’s mission is to develop and produce media for Film and Television within a variety of genres while maintaining a standard of excellence.","birthday":"1978-06-19","deathday":"","homepage":"http://www.zoesaldana.com/","id":8691,"imdb_id":"nm0757855","name":"Zoe Saldana","place_of_birth":"Passaic - New Jersey - USA","popularity":7.947243,"profile_path":"/g8nuPwQ9CXxfTVWK4r3TaxfQGqI.jpg"}