{"adult":false,"also_known_as":[],"biography":"From Wikipedia, the free encyclopedia.\n\nShane Rimmer (born 1932) is a Canadian actor and voice actor, probably best known as the voice of Scott Tracy in Thunderbirds.\n\nHe has mostly performed in supporting roles, frequently in films and television series filmed in the United Kingdom, having relocated to England in the late 1950s. His appearances include roles in such widely-known films as Dr. Strangelove (1964), Rollerball (1975), The Spy Who Loved Me (1977), Gandhi (1982), Out of Africa (1985) and Crusoe (1989). More recently he has appeared in Spy Game (2001), and Batman Begins (2005). In the earlier years of his career, there were several uncredited performances, among others for films such as You Only Live Twice (1967), Diamonds Are Forever (1971), Star Wars (1977) and Superman II (1980). With the exception of recurring featured cast members he has appeared in more James Bond films than any other actor.\n\nRimmer has a long association with Gerry Anderson. Thunderbirds fans may recognize him as the voice actor behind the character Scott Tracy. He drafted the plotline for the penultimate episode, \"Ricochet\", which was later turned into a script by Tony Barwick. He also wrote scripts and provided uncredited voices for Captain Scarlet and the Mysterons, Joe 90 and The Secret Service, has made appearances in episodes of Anderson's live-action UFO and The Protectors, has and provided voices for Space: 1999 and has guest-starred in the episode \"Space Brain\". In later years he starred in the unscreened pilot Space Police (later made into a series with other actors and titled Space Precinct) and provided the voice for Anderson's stop-motion gumshoe Dick Spanner, P.I..\n\nRimmer and fellow Anderson actor Ed Bishop often joked about how often their professional paths crossed and termed themselves \"Rent-a-Yanks\". They appeared together as NASA operatives in the opening of You Only Live Twice and as USN sailors in The Bedford Incident as well as touring together in live stage shows, including \"Death of a Salesman\" in the 1990s. He also appeared in Doctor Who in 1966, and in Coronation Street as two different characters: Joe Donnelli (1968–1970), who held Stan Ogden hostage in No. 5 before committing suicide, and Malcolm Reid (1988), father of Audrey Roberts' son Stephen.\n\nHe has made many guest appearances in British television series for ITV, including in Roald Dahl's Tales of the Unexpected, and ITC's The Persuaders!. In 1989 Rimmer was reunited with former Gerry Anderson actors Ed Bishop and Matt Zimmerman in the BBC Radio 4 adaptation of Sir Arthur Conan Doyle's A Study In Scarlet. Rimmer and Bishop also appeared in the BBC drama-documentary Hiroshima completed not long after Bishop's death in 2005. Note: His official website and travel record on the Immigration &amp; Travel section of Ancestry give his year of birth as 1929.\n\nDescription above from the Wikipedia article Shane Rimmer, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1932-05-28","deathday":"","homepage":"","id":10657,"imdb_id":"nm0727300","name":"Shane Rimmer","place_of_birth":null,"popularity":1.2E-5,"profile_path":"/ctrIOcWLjOB5rocS0vVHEjbS1Sx.jpg"}