{"adult":false,"also_known_as":["奥兰多·布鲁姆"],"biography":"Orlando Jonathan Blanchard Bloom is an English actor. He had his break-through roles in 2001 as the elf-prince Legolas in The Lord of the Rings and starting in 2003 as blacksmith Will Turner in the Pirates of the Caribbean trilogy of films, and subsequently established himself as a lead in Hollywood films, including Elizabethtown and Kingdom of Heaven. He appeared in the ensemble film New York, I Love You, and will have roles in Sympathy for Delicious and Main Street. Bloom made his professional stage debut in West End's In Celebration at the Duke of York's Theatre, St. Martin's Lane, which ended its run on 15 September 2007.\n\nOrlando Bloom was born in Canterbury, Kent, England. His mother, Sonia Constance Josephine (née Copeland), was born in the British section of Kolkata, India, the daughter of Betty Constance Josephine Walker and Francis John Copeland, who was a physician and surgeon. During his childhood, Bloom was told that his father was his mother's husband, South African-born Jewish anti-Apartheid novelist Harry Saul Bloom; but when he was thirteen (nine years after Harry's death), Bloom's mother revealed to him that his biological father was actually Colin Stone, his mother's partner and family friend. Stone, the principal of the Concorde International language school, was made Orlando Bloom's legal guardian after Harry Bloom's death. Bloom, who is named after the 16th century composer Orlando Gibbons, has one sister, Samantha Bloom, who was born in 1975.\n\nBloom's first appearance on the screen was as a rent boy in the 1997 film Wilde - he had a small part. Two days after graduating from Guildhall in 1999, he was cast in his first major role, playing Legolas in The Lord of the Rings (2001–2003). He had originally auditioned for the part of Faramir, who doesn't appear until the second movie but the director, Peter Jackson, cast him as Legolas instead.\n\nBloom met American actress Kate Bosworth outside a coffee shop in 2002, where he was introduced to her by a mutual friend. He met her again at the premiere of The Lord of the Rings: The Two Towers later that year. The two had an \"on-and-off relationship\" from 2002 until splitting up in September 2006. In late 2007, Bloom began dating Australian model Miranda Kerr. The couple's engagement was announced on June 21, 2010.\n\nBloom has said that he tries \"not to exclude [himself] from real life as much as possible\". He is a Manchester United fan and lives in London. During filming in Morocco for Kingdom of Heaven, Bloom rescued and adopted a dog, Sidi (a black Saluki mix with a white mark on his chest). Bloom is a practising Buddhist. In 2004, he became a full member of Soka Gakkai International, a lay Buddhist association affiliated with the teachings of Nichiren. Bloom has also been a part of Global Green, an environmental company, since the early 2000s. As part of his environmental involvement, he has renovated his London home to use solar panels, incorporate recycled materials, and utilize energy efficient lightbulbs. Bloom has been approached by UNICEF to act as an international ambassador.","birthday":"1977-01-13","deathday":"","homepage":"","id":114,"imdb_id":"nm0089217","name":"Orlando Bloom","place_of_birth":"Canterbury, Kent, UK","popularity":3.943909,"profile_path":"/vq90ECKinICxJYYZpbga4pMwch.jpg"}