{"adult":false,"also_known_as":[],"biography":"Drew Blyth Barrymore (born February 22, 1975) is an American film actress, producer, and director. She is a member of the Barrymore family of American actors and granddaughter of John Barrymore. She first appeared in an advertisement when she was 11 months old. Barrymore made her film debut in Altered States in 1980. Afterwards, she starred in her breakout role in E.T. the Extra-Terrestrial. She quickly became one of Hollywood's most recognized child actors, going on to establish herself in mainly comic roles. Following a turbulent childhood which was marked by drug and alcohol abuse and two stints in rehab, Barrymore wrote the 1990 autobiography, Little Girl Lost. She successfully made the transition from child star to adult actress with a number of films including Poison Ivy, Bad Girls, Boys on the Side, and Everyone Says I Love You. Subsequently, she established herself in romantic comedies such as The Wedding Singer and Lucky You. In 1995, she and business partner Nancy Juvonen formed the production company Flower Films, with its first production the 1999 Barrymore film Never Been Kissed. Flower Films has gone on to produce the Barrymore vehicle films Charlie's Angels, 50 First Dates, and Music and Lyrics, as well as the cult film Donnie Darko. Barrymore's more recent projects include He's Just Not That into You, Beverly Hills Chihuahua, Everybody's Fine and Going the Distance. A recipient of a star on the Hollywood Walk of Fame, Barrymore appeared on the cover of the 2007 People magazine's 100 Most Beautiful issue. Barrymore was named Ambassador Against Hunger for the United Nations World Food Programme (WFP). Since then, she has donated over $1 million to the program. In 2007, she became both CoverGirl's newest model and spokeswoman for the cosmetic and the face for Gucci's newest jewelry line. In 2010, she was awarded the Screen Actors Guild Award and the Golden Globe Award for Best Actress in a Miniseries or Television Film for her portrayal of Little Edie in Grey Gardens. \nDescription above from the Wikipedia article Drew Barrymore , licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1975-02-22","deathday":"","homepage":"http://www.drewbarrymore.com/","id":69597,"imdb_id":"nm0000106","name":"Drew Barrymore","place_of_birth":"Culver City","popularity":7.273588,"profile_path":"/qebOZZCeYgOlh30tH4PvmJweo6F.jpg"}