{"adult":false,"also_known_as":[],"biography":"From Wikipedia, the free encyclopedia \n\nGregor \"Gore\" Verbinski is an American film director and writer, best known for directing the first three Pirates of the Caribbean films and The Ring.\n\nVerbinski was born the third of five children to Vic and Laurette Verbinski in Oak Ridge, Tennessee. His siblings are Janine, Claire, Diane and Steven. His father was of Polish descent and worked as a nuclear physicist at Oak Ridge National Laboratory. In 1967 the Verbinski family moved to Southern California, where a young Gregor grew up in the town of La Jolla.\n\nGregor was an active Boy Scout and surfed regularly. He went to Torrey Pines Elementary, Muirlands Junior High, and La Jolla High School before attending UCLA Film School. Verbinski graduated with his BFA in Film from UCLA in 1987.\n\nVerbinski was active in several L.A. rock bands early in his career. His first band was Thelonius Monster, which included drummer Danny Heifetz. He also played in the Daredevils, Bulldozer, The Drivers, and the all-star band The Cylon Boys Choir.\n\nHe was also in a band called The Little Kings, which backed Stiv Bators on his version of \"Have Love Will Travel\". Along with a cover of the Moody Blues song \"The Story in Your Eyes\" (by other musicians), the song was released by Bators in the Fall of 1986 as a 12-inch single on Bomp! (catalogue #12136) and was later included in Bators' compilation album L.A. L.A. On the compilation album's liner notes, label owner Greg Shaw described the band as \"an adequate but rootless Hollywood glam-damaged band with tattoos\".\n\nHis first films were a series of 8 mm films called \"The Driver Files\" circa 1979, when he was a young teen. Although most associate Verbinski with feature films, he started his career directing music videos for bands like Bad Religion, NOFX, 24-7 Spyz and Monster Magnet working at Palomar Pictures. This was not surprising to his friends in Los Angeles, since he had been in various punk and rock bands; the Daredevils, for instance, included then-departed member of Bad Religion Brett Gurewitz.\n\nVerbinski moved from music videos to commercials, where he worked for many brand names including Nike, Coca-Cola, Canon, Skittles and United Airlines. One of his most famous commercials was for Budweiser, featuring frogs who croak the brand name. For his efforts in commercials, Verbinski won four Clio Awards and one Cannes Advertising Silver Lion.\n\nAfter completing a short film, The Ritual (which he both wrote and directed), Verbinski made his feature film directing debut with his comedy flick, Mouse Hunt. The film was a hit globally and he soon followed up the success with the action/comedy The Mexican, starring Julia Roberts and Brad Pitt. The film received mixed reviews, and performed modestly at the box-office, earning $68 million domestically which was quite meager considering its star power (it was technically successful due to its moderately low $38 million budget). Verbinski followed it up with the horror film remake The Ring (2002), which struck gold globally, grossing well over $200 million worldwide. Verbinski also had a directorial hand in The Time Machine that year, temporarily taking over for an exhausted Simon Wells. Verbinski directed some of the underground Morlock sequences and is given a Thanks to credit in the film.\n\nHe then directed the very successful Pirates of the Caribbean: The Curse of the Black Pearl which earned over $600 million at the international box office.\n\nHis next film was The Weather Man which starred Nicolas Cage. The film received mixed to positive reviews but was a box office failure.\n\nIn March 2005 he started filming the sequels Pirates of the Caribbean: Dead Man's Chest and Pirates of the Caribbean: At World's End. The former then became his biggest success so far, becoming the third film ever to gross over $1 billion at the international box office.\n\nHis future project will be an adaption of William Monahan's novel Light House: A Trifle, which is a story about an artist running away from the Mafia who hides in a lighthouse, in which kooky characters live. He will also direct Butterfly, about a man trying to drive his wife insane.\n\nVerbinski was also set to direct a film for Universal based on the video game, BioShock.  However he has since been replaced by Juan Carlos Fresnadillo as director, but he will still produce. Verbinski announced in July the film had an R-rating, formerly was planned with an PG-13 rating. It has also been announced that he direct a remake of the film Clue, based on the board game.\n\nDescription above from the Wikipedia article Gore Verbinski, licensed under CC-BY-SA, full list of contributors on Wikipedia.","birthday":"1964-03-16","deathday":"","homepage":"","id":1704,"imdb_id":"nm0893659","name":"Gore Verbinski","place_of_birth":"Oak Ridge, Tennessee, USA","popularity":0.659552,"profile_path":"/bV0rGSPrK4AUvODjB3zMAwDdeIf.jpg"}