{"adult":false,"also_known_as":[],"biography":"From Wikipedia, the free encyclopedia.  \n\nAnnaSophia Robb (born December 8, 1993, height 5' (1,52 m)) is an American film and television actress. She gained prominence in 2005 with starring roles in Because of Winn-Dixie and Charlie and the Chocolate Factory, and subsequently starred in the 2007 film Bridge to Terabithia and the 2009 film Race to Witch Mountain, alongside with the 2011 film Soul Surfer.\n\nAfter starring in a commercial for McDonald's, Robb made her acting debut in 2004; she had a small role in the episode \"Number One Fan\" of the television series Drake &amp; Josh (her character informs Josh that the group only joined the Campfire Kids so they could hang out with their friends and eat free food). Her first major role was as the title character in the television special Samantha: An American Girl Holiday. Her hair was dyed dark brown for the part.\n\nRobb's two big-screen appearances in 2005 were both adaptations of popular children's books. She starred as Opal in Because of Winn-Dixie and as the competitive and rude gum-chewer Violet Beauregarde in Tim Burton's remake of Charlie and the Chocolate Factory. The latter was a major box office success worldwide, and helped escalate Robb's popularity among preteen audiences. She became friends with many of her co-stars, including Julia Winter and Missi Pyle (who played her on-screen mother, Scarlett), and enjoyed working with Johnny Depp. She requested that the scene of Violet hugging Wonka in the factory's entrance hall be included in the film.\n\nIn 2005, Robb was the face of Trad Clothing, helping to design and model a fashion line for girls. In 2006, she had a guest role on the cartoon show Danny Phantom as the voice of Danielle \"Dani\" Fenton.\n\nRobb played Leslie Burke in Bridge to Terabithia, which opened in U.S. theaters on February 16, 2007. She recorded a song for the soundtrack titled \"Keep Your Mind Wide Open\", and the accompanying video received rotation on the Disney Channel. The song appeared on the Billboard Hot 100 at #90 during the week of March 1, giving Robb her first charting single. Robb was a fan of the book before being cast in the role, saying that it \"touched me in a way I hadn’t been touched by a book before.\"\n\nRobb went on to appear in The Reaping, Jumper (in which she played the younger version of Rachel Bilson's character Millie), Have Dreams, Will Travel and Spy School. Robb's performance in the film Sleepwalking garnered praise; Time film critic Richard Schickel said, \"There is a wonderful range to Robb's work...this is extraordinarily mature acting from someone this young and she wins our sympathy without once begging for it.\"\n\nRobb starred alongside Dwayne Johnson in Race to Witch Mountain, which was released in March 2009.\n\nIn 2010, she filmed The Space Between with actress Melissa Leo. She starred in Soul Surfer playing the role of Bethany Hamilton, who continued to surf after losing her arm in a shark attack.\n\nRobb has been confirmed to star as Wendy in the new dark take on Peter Pan directed by Helmer Ben Hibon, tentatively titled Pan. She will also voice Periwinkle in the animated film Tinker Bell and the Mysterious Winter Woods which will be released in Christmas 2012.","birthday":"1993-12-08","deathday":"","homepage":"http://www.annasophiarobb.com/","id":1285,"imdb_id":"nm1455681","name":"AnnaSophia Robb","place_of_birth":"Denver - Colorado - USA","popularity":5.808806,"profile_path":"/bFUVeM3XfAqb0tzshthI52ZrXip.jpg"}