{"adult":false,"also_known_as":[],"biography":"Natalie Portman is an actress with dual American and Israeli citizenship. Her first role was as an orphan taken in by a hitman in the 1994 action film Léon: The Professional, but mainstream success came when she was cast as Padmé Amidala in the Star Wars prequel trilogy (released in 1999, 2002 and 2005). In 1999, she enrolled at Harvard University to study psychology while still working as an actress. She completed her bachelor's degree in 2003.\n\nIn 2001, Portman opened in New York City's Public Theater production of Anton Chekhov's The Seagull. In 2005, Portman won a Golden Globe Award and received an Academy Award nomination for Best Supporting Actress for her performance in the drama Closer. She won a Constellation Award for Best Female Performance and a Saturn Award for Best Actress for her starring role in V for Vendetta (2006). She played leading roles in the historical dramas Goya's Ghosts (2006) and The Other Boleyn Girl (2008). In May 2008, she served as the youngest member of the 61st Annual Cannes Film Festival jury. Portman's directorial debut, Eve, opened the 65th Venice International Film Festival's shorts competition in 2008. Portman directed a segment of the collective film New York, I Love You. Portman is also known for her portrayal as Jane Foster, the love interest of Marvel superhero Thor, in the film adaptation Thor (2011), and its sequel, Thor: The Dark World (2013).\n\nIn 2010, Portman starred in the psychological thriller Black Swan. Her performance received critical praise and earned her a second Golden Globe Award, the Screen Actors Guild Award, the BAFTA Award, the Broadcast Film Critics Association Award and the Academy Award for Best Actress in 2011.","birthday":"1981-06-09","deathday":"","homepage":"http://www.natalieportman.com","id":524,"imdb_id":"nm0000204","name":"Natalie Portman","place_of_birth":"Jerusalem - Israel","popularity":7.898989,"profile_path":"/s4pcj0A9PIOFiNyaB8NreTJbPsX.jpg"}