{"adult":false,"also_known_as":[],"biography":"James was born in Leeds, West Yorkshire, and raised in Bishop's Stortford, Hertfordshire, with his eight brothers and sisters in the shadow of London's Stansted airport. His father was a stockbroker and his mother was a teacher. He was educated at Newport Free Grammar School. He earned his degree in Drama and Film at the University of East Anglia, and went on to study acting at London's prestigious Central School of Speech and Drama. He worked a variety of jobs in social work, factories, and the service industry, before traveling throughout India.\nWhile studying in London, Frain was spotted by Sir Richard Attenborough, who immediately cast him in his first feature, Shadowlands (1993), opposite Sir Anthony Hopkins and Debra Winger. With theater credits for The Royal Shakespeare Company and Royal Court, as well as, in the West End in a range of classical and modern plays, Frain's reputation quickly spread to television and film, where he won leading roles in the Oscar nominated features, Elizabeth (1998) with Cate Blanchett, and Hilary and Jackie (1998) with Rachel Griffiths. James reunited on screen with Sir Anthony Hopkins in Fox Searchlight's film, Titus (1999).\nIn 2007, he appeared with Ian McShane on Broadway in \"The Homecoming\" - for which the cast won The Drama Critics Circle Award for Best Ensemble.\nIn the U.S., Frain played leading roles in The Count of Monte Cristo (2002) with Jim Caviezel and Guy Pearce, Where the Heart Is (2000) opposite Natalie Portman, Deception (2000) with Ben Affleck and Charlize Theron, and Into the Blue (2005) with Paul Walker. Since moving to the States, Frain has continued to work on both sides of the Atlantic, maintaining his profile in the European independent film scene while working on popular American television series, such as \"Californication\" (2007), \"FlashForward\" (2009), \"24\" (2001), \"Grey's Anatomy\" (2005), \"In Plain Sight\" (2008), \"The Closer\" (2005), \"Law &amp; Order: Criminal Intent\" (2001) and \"CSI: Crime Scene Investigation\" (2000), among others.\nJames is probably best-known for his performance as \"Thomas Cromwell\" over three seasons of Showtime's critically-acclaimed series, \"The Tudors\" (2007). He appeared opposite Kate Beckinsale, Drew Barrymore, Sam Rockwell and Robert De Niro in Everybody's Fine (2009). He had a major arc on HBO's hit series, \"True Blood\" (2008), playing \"Franklin Mott\"; \"a tall, dark, and sexy vampire\".\nHe was last seen in Disney's TRON: Legacy (2010), opposite Jeff Bridges, released in December 2010.","birthday":"1968-03-14","deathday":"","homepage":"","id":22063,"imdb_id":"nm0289656","name":"James Frain","place_of_birth":"Leeds, England, UK","popularity":1.768445,"profile_path":"/eD8JioHl7dIsQOaBrubT7jMqZJV.jpg"}