{"adult":false,"also_known_as":["Takayo Tsubouchi"],"biography":"From Wikipedia, the free encyclopedia\n\nTakayo Fischer (born November 25, 1932) is an American stage, film and TV actress, as well as voice-over actress and singer.\n\nPersonal life\n\nFischer was born in Hardwick, California, the daughter of Issei (Japanese immigrants) Chukuro and Kinko Tsubouchi. During World War II, as a young child, she and her family were forcibly evacuated from the West Coast and spent time in the Fresno Assembly Center before being relocated to Jerome and Rohwer internment camps. Fischer later lived in Chicago, Illinois, where, as a young adult, she won the crown of \"Miss Nisei Queen.\" She attended Rollins College from 1951-1953. After her 2nd year at Rollins College she married Dean Doran the day after he graduated from Rollins, in the college chapel, and had 3 children by him within 4 years. Toya: (1954), John (1956) Juliet (1957.). She married Sy Fischer, 2nd husband, (an entertainment executive) on November 29, 1980 . Her 2nd husband has 2 children Stewart and Peter. She resides in Los Angeles.\n\nCareer\n\nFischer appeared in the stage production of The World of Suzie Wong in New York in 1958. She won a Drama-Logue Award for ensemble performance for Tea at the Old Globe Theatre in San Diego. She has also appeared in many productions with East West Players in Los Angeles, including Into The Woods. She toured the U.S. and Europe in The Peony Pavilion in 1997.\n\nFischer has appeared in many big-budget films, including Moneyball, Pirates of the Caribbean: At World's End (2007) as Mistress Ching, The Pursuit of Happyness (2006) as Mrs. Chu, Memoirs of a Geisha (2005) and War of the Worlds (2005). She has also worked on many independent Asian American films including Americanese (2009), Only the Brave (2005), Stand Up for Justice: The Ralph Lazo Story (2004) and Strawberry Fields (1997).\n\nFischer has had numerous guest-starring roles on network television including FX's It's Always Sunny In Philadelphia as a North Korean bar owner named Mr. Kim. She is sometimes credited as \"Takayo Doran.\"\n\nVoice work\n\nFischer has also done voices in several cartoon programmes. Some of her well-known roles included Mister T, Battle of the Planets, Rubik the Amazing Cube, A Pup Named Scooby-Doo, Saturday Supercade, The Flintstone Kids, Batman: The Animated Series, Batman Beyond, The All-New Scooby and Scrappy-Doo Show, The Karate Kid, Capitol Critters, The Centurions, The Plastic Man Comedy/Adventure Show, The Heathcliff and Dingbat Show, Super Friends, Thundarr the Barbarian, Rambo, Wildfire, Captain Planet and the Planeteers, Teen Titans, Justice League Unlimited and Avatar: The Last Airbender.\n\nShe has also reprised her role as Mistress Ching in the video game version of Pirates of the Caribbean: At World's End.","birthday":"1932-11-25","deathday":"","homepage":"","id":33500,"imdb_id":"nm0279137","name":"Takayo Fischer","place_of_birth":"Hardwick - California - USA","popularity":0.017223,"profile_path":"/gNIFc8rWnFzplkisEonefyxjmG1.jpg"}